# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [20]:
series1 = pd.Series(np.random.randint(1, 5, size=100))
series2 = pd.Series(np.random.randint(1, 4, size=100))
series3 = pd.Series(np.random.randint(10000, 30001, size=100))

print(series1)

0     3
1     1
2     4
3     3
4     1
     ..
95    3
96    1
97    3
98    3
99    2
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [11]:
df = pd.concat([series1, series2, series3], axis=1)
df

    0  1      2
0   3  1  28785
1   4  2  25416
2   4  3  17878
3   2  2  18746
4   2  1  14617
.. .. ..    ...
95  1  2  28130
96  4  3  14828
97  2  3  11869
98  4  3  29350
99  3  1  18675

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [14]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       3       1            28785
1       4       2            25416
2       4       3            17878
3       2       2            18746
4       2       1            14617
..    ...     ...              ...
95      1       2            28130
96      4       3            14828
97      2       3            11869
98      4       3            29350
99      3       1            18675

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [28]:
bigseries = pd.concat([series1, series2, series3], axis=0)

bigcolumn = bigseries.to_frame()

bigcolumn

        0
0       3
1       1
2       4
3       3
4       1
..    ...
95  14810
96  19123
97  12487
98  23285
99  14793

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [29]:
bigcolumn.shape

(300, 1)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [31]:
bigcolumn.reset_index(drop=True, inplace=True)

bigcolumn

         0
0        3
1        1
2        4
3        3
4        1
..     ...
295  14810
296  19123
297  12487
298  23285
299  14793

[300 rows x 1 columns]